Revit 2027 API
FamilySymbol.Origin Property
 The point in the symbol's space corresponding to the insertion point/origin as seen from outside the symbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Origin { get; }
Public ReadOnly Property Origin As XYZ
	Get
public:
property XYZ^ Origin {
	XYZ^ get ();
}
member Origin : XYZ with get
Property Value
XYZ
See Also
Reference
FamilySymbol Class
Autodesk.Revit.DB Namespace